---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarHostData.GetAreaReinforcementsInHost
source: html/28ecf84e-491a-4407-b6c8-37ab4cbc0257.htm
---
# Autodesk.Revit.DB.Structure.RebarHostData.GetAreaReinforcementsInHost Method

Returns all AreaReinforcement elements hosted by the referenced element.

## Syntax (C#)
```csharp
public IList<AreaReinforcement> GetAreaReinforcementsInHost()
```